Repository: miurahr/aqtinstall-docs-omegat-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Let's say we need to install some modules for Qt 5.15.2 on Windows Desktop. First we need to find out what the modules are called, and we can do that with :ref:`aqt list-qt <list-qt command>` with the ``--modules`` flag. Each version of Qt has a different list of modules for each host OS/ target SDK/ architecture combination, so we will need to supply :ref:`aqt list-qt <list-qt command>` with that information:
ja: Qt 5.15.2用のモジュールをWindows Desktopにインストールする必要があるとします。まず、モジュールが何と呼ばれているかを調べる必要があります。そのためには :ref:`aqt list-qt <list-qt command>` と ``--modules`` フラグを使用します。Qtの各バージョンには、ホストOS/ターゲットSDK/アーキテクチャの組み合わせごとに異なるモジュールリストがあるので、その情報を :ref:`aqt list-qt <list-qt command>` に提供する必要があります:

source: Let's say we need to use ``qtmultimedia``, ``qtdeclarative``, ``qtsvg``, and nothing else.
ja: ``qtmultimedia``、``qtdeclarative``、``qtsvg``を使う必要があり、それ以外は何も使わないとしましょう。

source: Let's see what happens when we try to list architectures and modules for Qt 6:
ja: Qt 6のアーキテクチャとモジュールをリストアップしようとすると何が起こるか見てみましょう。

source: Let's see what tool variants are available in `tools_mingw`:
ja: ``tools_mingw`` で利用できるツールのバリエーションを見てみましょう:

source: List available tools
ja: 使用可能なツールを一覧表示

source: List available versions of Qt, targets, extensions, modules, and architectures.
ja: Qtの利用可能なバージョン、ターゲット、拡張、モジュール、アーキテクチャを表示します。

source: List command
ja: リストコマンド

source: List documentation archives and modules available for installation using the `install-doc command`_.
ja: `install-docコマンド`_ を使ってインストール可能なドキュメントアーカイブとモジュールをリストアップできます。

source: List example archives and modules available for installation using the `install-example command`_.
ja: `install-example command`_ を使ってインストール可能なアーカイブとモジュールの例を挙げます。

source: List source archives available for installation using the `install-src command`_.
ja: `install-src command`_ を使って、インストール可能なソースアーカイブを一覧表示します。

source: List-* Commands
ja: List-*コマンド

source: Long display for modules: Similar to ``--modules``, but shows extra metadata associated with each module.
ja: モジュールの長い表示: ``--modules`` と似ていますが、各モジュールに関連付けられた追加のメタデータを表示します。

source: Long display: shows extra metadata associated with each tool variant.
ja: 長い表示: 各ツールバリアントに関連付けられた追加のメタデータを表示します。

source: Main purpose is speed up CI/CD process by limiting installed modules.
ja: 主な目的は、インストールされているモジュールを制限することによってCI/CDプロセスを高速化することです。

source: May be combined with any other flag to filter the output of that flag.
ja: 他のフラグと組み合わせて、そのフラグの出力をフィルタリングすることができます。

source: Minimum Python version: 3.6
ja: Pythonの最小バージョン:3.6

source: Minimum Qt Installation
ja: Qtの最小インストール

source: Most of these commands share the same command line options, and these options are described here:
ja: これらのコマンドのほとんどは、同じコマンドラインオプションを共有しています。次に、これらのオプションについて説明します。

source: Most users will not need to keep these files.
ja: ほとんどのユーザはこれらのファイルを保持する必要はありません。

source: New command only can take --kde option
ja: 新しいコマンドは--kdeオプションしか使えません

source: New sub commands
ja: 新しいサブコマンド

source: New syntax doesn't take version
ja: 新しい構文はバージョンを使用しません

source: Normally, when you run ``aqt install-qt``, the program will print a long list of archives that it is downloading, extracting, and installing, including ``qtbase``, ``qtmultimedia``, ``qt3d``, and ~25 more items. We can use the ``--archives`` flag to choose which of these archives we will actually install. The ``--archives`` flag can only affect two modules: the base Qt installation and the ``debug_info`` module.
ja: 通常、``aqt install-qt`` を実行すると、このプログラムはダウンロード、抽出、インストールしているアーカイブの長いリストを出力します。このリストには、``qtbase``、``qtmultimedia``、``qt3d``、そして約25項目が含まれています。これらのアーカイブのどれを実際にインストールするかは、``--archives`` フラグを使って選択することができます。 ``--archives`` フラグは、Qtの基本インストールモジュールと``debug_info``モジュールの2つのモジュールにしか影響しません。

source: Note that if your terminal is wider than 95 characters, this command will show release dates and sizes in extra columns to the right.
ja: 端末の表示幅が95文字以上の場合、このコマンドはリリース日とサイズを右側のスペースに表示します。

source: Note that this option refers to the intermediate ``.7z`` archives that ``aqt`` downloads and then extracts to ``--outputdir``.
ja: このオプションは、 ``aqt`` がダウンロードして ``--outputdir`` に展開する中間の ``.7z`` アーカイブを参照していることに注意してください。

source: Note that winrt is only available on Windows, and ios is only available on Mac OS.
ja: winrtはWindowsでしか使用できず、iosはMac OSでしか使用できません。

source: Notice that the version numbers are sorted, grouped by minor version number, and separated by a single space-character.
ja: バージョン番号がソートされ、マイナーバージョン番号でグループ化され、1つのスペース文字で区切られていることに注意してください。

source: Notice that this is a very small subset of the architectures listed in the `Available Qt versions`_ wiki page.
ja: これは `Available Qt versions`_ wikiページにリストされているアーキテクチャの非常に小さなサブセットであることに注意してください。

source: Notice what we did here: We specified the ``qtcharts`` and ``debug_info`` modules, and we specified the ``qtbase``, ``qtcharts``, and ``qtdeclarative`` archives.
ja: ここで行ったことに注目してください:``qtcharts`` モジュールと``debug_info``モジュールを指定し、``qtbase``アーカイブ、``qtcharts``アーカイブ、``qtdeclarative`` アーカイブを指定しました。

source: Now let's install `mingw`, using the :ref:`aqt install-tool <tools installation command>` command.
ja: では、:ref:`aqt install-tool <tools installation command>` コマンドを使って`mingw`をインストールしましょう。

source: Now let's say we need to install the ``debug_info`` module, which is particularly large: around one gigabyte. We do not want to install all of it, so we can use ``aqt install-qt --archives`` to choose which archives we want to install. Remember that the ``--archives`` flag
ja: ここで、``debug_info``モジュールをインストールする必要があるとしましょう。このモジュールは非常に大きく、約1.0GBです。すべてをインストールしたくないので、``aqt install-qt --archives``を使ってインストールしたいアーカイブを選ぶことができます。この場合の``--archives``フラグは

source: Now that we know what versions of Qt are available, let's choose version 6.2.0.
ja: 使用可能なQtのバージョンがわかったので、バージョン6.2.0を選択します。

source: On Linux, you can specify p7zip_, a Linux port of 7-zip_, which is often installed by default, using this command:
ja: Linuxでは、次のコマンドを使用して p7zip_ (Linuxに移植された 7-zip_ )を指定できます。これはデフォルトでインストールされることが多い 7-zip_ です。

source: One way to install all modules available for Qt 5.15.2 is to send the output of :ref:`aqt list-qt <list-qt command>` into :ref:`aqt install-qt <qt installation command>`, like this:
ja: Qt 5.15.2で利用可能なすべてのモジュールをインストールする1つの方法は :ref:`aqt list-qt <list-qt command>` の出力を :ref:`aqt install-qt <qt installation command>` に以下のように送ることです:

source: Optional field to specify tool variant.
ja: ツールバリアントを指定するオプションのフィールド。

source: Options:
ja: オプション:

source: Original qli-installer is written by Linus Jahn
ja: オリジナルのqli-installerはLinus Jahn氏によって書かれました。

source: Please disclose security vulnerabilities privately at miurahr@linux.com
ja: セキュリティの脆弱性については、miurahr@linux.com に提示してください。

source: Please note that ``aqt install-tool`` does not recognize the ``installscript.qs`` related to each tool.
ja: ``aqt install-tool`` は、各ツールに関連する``installscript.qs`` を認識しないことに注意してください。

source: Please note that every ``aqt`` subcommand has a ``--help`` option; please use it if you are having trouble!
ja: すべての ``aqt`` サブコマンドには ``--help`` オプションがあります。なにか疑問が発生した場合は、このオプションを使用してください!

source: Please note that when you install Qt for android or ios, the installation will not be functional unless you install the corresponding desktop version of Qt alongside it.
ja: Qt for androidまたはiosをインストールする場合、対応するデスクトップバージョンのQtを一緒にインストールしない限り、正しく機能しないことに注意してください。

source: Print only the newest version available May be combined with the ``--extension`` and/or ``--spec`` flags.
ja: 入手可能な最新バージョンのみを印刷します。 ``--extension`` フラグや ``--spec`` フラグと組み合わせることができます。

source: Print versions of Qt within a `SimpleSpec`_ that specifies a range of versions.
ja: バージョンの範囲を指定する `SimpleSpec`_ 内のQtのバージョンを表示します。

source: Print versions of Qt within a `SimpleSpec`_ that specifies a range of versions. You can specify partial versions, inequalities, etc. ``"*"`` would match all versions of Qt; ``">6.0.2,<6.2.0"`` would match all versions of Qt between 6.0.2 and 6.2.0, etc. For example, ``aqt list-qt windows desktop --spec "5.12"`` would print all versions of Qt for Windows Desktop beginning with 5.12. May be combined with any other flag to filter the output of that flag.
ja: バージョンの範囲を指定する `SimpleSpec`_ 内のQtのバージョンを表示します。部分的なバージョンや不等式などを指定できます。``"*"`` はQtのすべてのバージョンにマッチし、``">6.0.2,<6.2.0"`` は6.0.2から6.2.0までのQtのすべてのバージョンにマッチします。例えば、``aqt list-qt windows desktop --spec "5.12"`` と入力すると、5.12から始まるWindows デスクトップ用のQtのすべてのバージョンが出力されます。他のフラグと組み合わせて、そのフラグの出力をフィルタリングすることができます。

source: Project owner: Hiroshi Miura
ja: プロジェクトオーナー:三浦広志

source: Qt version in the format of "5.X.Y", or the keyword ``latest``.
ja: "5.X.Y"形式のQtバージョン、またはキーワード``latest``。

source: Qt version in the format of "5.X.Y", or the keyword ``latest``. When set, this prints all valid arguments for the ``--extension`` flag for Qt 5.X.Y, or the latest version of Qt if ``latest`` is specified. Incompatible with the ``--extension`` flag.
ja: "5.X.Y"形式のQtバージョン、またはキーワード``latest``。これを設定すると、Qt 5.X.Yの`--extension`フラグの有効な引数をすべて出力します。または、``latest``が指定されている場合はQtの最新バージョンを出力します。`--extension`フラグとは互換性がありません。

source: Recommended Python version: 3.7.5 or later
ja: 推奨Pythonバージョン:3.7.5以降

source: Remember that the :ref:`aqt list-qt <list-qt command>` command is meant to be scriptable?
ja: :ref:`aqt list-qt <list-qt command>` コマンドは、スクリプト化できるように意図して作られていることを覚えていますか?

source: Remember that the ``qtbase`` archive is required for a minimal working Qt installation.
ja: ``qtbase``アーカイブは最低限動作するQtインストールに必要であることを覚えておいてください。

source: Reporting a Vulnerability
ja: 脆弱性の報告

source: Requirements
ja: 要件

source: Resources
ja: リソース

source: Same as usual, it can be installed with `pip`
ja: いつもと同じように、``pip`` でインストールできます。

source: Security Policy
ja: セキュリティポリシー

source: Security fixes only
ja: セキュリティ修正のみ

source: See :ref:`the Configuration section<configuration-ref>`.
ja: :ref:`the Configuration section <configuration-ref>` を参照してください。

source: See `common options`_.
ja: `common options`_ 参照

source: Send patch
ja: パッチを送信

source: Set the destination path for downloaded archives (temp directory by default).
ja: ダウンロードしたアーカイブの保存先パスを設定します(デフォルトディレクトリ)を設定します。

source: Setting this value too low will hammer the server, and may result in no successful connections at all.
ja: この値をあまりに低く設定するとサーバに衝撃を与え、接続が全く成功しなくなる可能性があります。

source: Settings
ja: 設定

source: Significant contributions for improvements of version 2.0 and 2.1 by David Dalcino David also leads many developments and reviews effort after 2.0.
ja: David Dalcinoによるバージョン2.0と2.1の改善への重要な貢献がありました。バージョン2.0以降の多くの開発とレビューの取り組みも主導しています。

source: Some mirror sites ignore a connection from IP addresses out of their preffered one.
ja: 一部のミラーサイトでは、優先されたIPアドレスからの接続以外が無視されます。

source: Some older operating systems may require you to specify Python version 3, like this: ``python3 -m aqt``.
ja: 古いオペレーティングシステムでは、``python3-m aqt``のようにPythonバージョン3を指定する必要があるかもしれません。

source: Specify external 7zip command path.
ja: 外部7zipコマンドのパスを指定します。

source: Specify extra modules to install as a list.
ja: リストとしてインストールする追加モジュールを指定してください。

source: Specify mirror site base url such as -b ``https://mirrors.dotsrc.org/qtproject`` where 'online' folder exist.
ja: 'online' フォルダが存在する -b ``https://mirrors.dotsrc.org/qtproject`` などのミラーサイトベースURLを指定します。

source: Specify output directory.
ja: 出力ディレクトリを指定します。

source: Specify the path to your own ``settings.ini`` file.
ja: 独自の ``settings.ini`` ファイルへのパスを指定します。

source: Stable version
ja: 安定バージョン

source: Status
ja: ステータス

source: Status: Beta
ja: ステータス:ベータ

source: Supported Versions
ja: サポートされているバージョン

source: The 'Qt version' argument can be in the format "5.X.Y" or the "latest" keyword.
ja: 'Qt version'引数は、"5.X.Y"または"latest"キーワードの形式にすることができます。

source: The CLI uses argparse to parse the command line options so the short or long versions may be used and the long options may be truncated to the shortest unambiguous abbreviation.
ja: コマンドラインのインタフェースは、argparseライブラリを使用してコマンドラインのオプションを解析します。そのため、オプションに、短いバージョンや長いバージョンが使用できるます。長いオプションは最も短い明確な省略形も提供ます。

source: The Linux/Mac port of 7-zip is called ``p7zip``, and you can install it with brew_ on Mac, or on Linux with your package manager.
ja: Linux/Macのポートである 7-zipは ``p7zip`` と呼ばれており、brew_ on Macでインストールするか、Linuxではパッケージマネージャを使ってインストールすることができます。

source: The Qt 6 for Android repositories are a little different than the Qt 5 repositories, and the :ref:`aqt list-qt <list-qt command>` tool doesn't know where to look for modules and architectures if you don't tell it what architecture you need.
ja: Qt 6 for AndroidリポジトリはQt 5リポジトリとは少し異なり、 :ref:`aqt list-qt <list-qt command>` ツールは、必要なアーキテクチャを教えなければ、モジュールやアーキテクチャを探す場所を知りません。

source: The `Available Qt versions`_ wiki page was last modified at some point in the past, so it may or may not be up to date.
ja: `Available Qt versions`_ wikiページは過去のある時点での更新ですので、最新であるかどうかは保障されません。

source: The ``-l`` flag causes :ref:`aqt list-tool <list-tool command>` to print a table that shows plenty of data pertinent to each tool variant available in `tools_mingw`. :ref:`aqt list-tool <list-tool command>` additionally prints the 'Display Name' and 'Description' for each tool if your terminal is wider than 95 characters; terminals that are narrower than this cannot display this table in a readable way.
ja: :ref:`aqt list-tool <list-tool command>` は、``tools_mingw`` で利用可能な各ツールに関連する、豊富なデータが含まれるテーブルを出力します。:ref:`aqt list-tool <list-tool command>` は、端末の幅が95文字より広い場合、各ツールの 「表示名」と「説明」を出力します。これより表示幅の狭い端末では、このテーブルを読みやすい形で表示することはできません。

source: The ``False`` setting will hide the stack trace, unless an unhandled exception occurs.
ja: ``False``に設定すると、未処理の例外が発生しない限り、スタックトレースは表示されません。

source: The ``True`` setting causes a stack trace to be printed to stderr any time an error occurs that will end the program.
ja: ``True`` に設定すると、プログラムを終了させるエラーが発生するたびにスタックトレースがstderrに出力されます。

source: The ``True`` setting turns on the ``--keep`` option every time you run aqt, and cannot be overridden by command line options.
ja: ``True`` が設定さえると、 ``--keep`` オプションが、aqt実行時に毎回指定されたことになります。コマンドラインオプションで上書きできません。

source: The ``[aqt]`` section configures basic behavior.
ja: ``[aqt]`` セクションは基本的な動作を設定します。

source: The ``[mirrors]`` section is a configuration for mirror handling.
ja: ``[mirrors]`` セクションはミラー処理のための設定です。

source: The ``[requests]`` section controls the way that ``aqt`` makes network requests.
ja: ``[requests]`` セクションは、``aqt`` がネットワークリクエストを行う方法を制御します。

source: The ``aqt install-qt`` installs this module by default.
ja: ``aqt install-qt`` はデフォルトでこのモジュールをインストールします。

source: The ``aqt list-qt --modules`` command is incapable of printing this module.
ja: ``aqt list-qt--modules`` コマンドはこのモジュールの説明を表示できません。

source: The ``xargs`` equivalent to this command is an exercise left to the reader.
ja: この ``xargs`` に相当するコマンドは、読者の練習課題です。

source: The compiler architecture for which you are developing.
ja: 開発対象のコンパイラアーキテクチャ。

source: The connection timeout, in seconds, for the download site.
ja: ダウンロードサイトの接続タイムアウト(秒単位)。

source: The fully-qualified name of the **base Qt installation** module is usually something like ``qt.qt6.620.gcc_64``. The fully-qualified name of the ``qtcharts`` module could be something like ``qt.qt6.620.qtcharts.gcc_64``. It would be difficult to read and write a list of 20 modules with the prefix ``qt.qt6.620.`` and the suffix ``.gcc_64``, because these parts are repetitive and not meaningful. Only the ``qtcharts`` part is useful.
ja: **base Qt installation** モジュールの完全修飾名は通常、``qt.qt6.620.gcc_64`` のようなものです。``qtcharts`` モジュールの完全修飾名は通常、``qt.qt6.620.qtcharts.gcc_64`` のようなものです。プレフィックス ``qt.qt6.620.``とサフィックス``.gcc_64``を持つ20個のモジュールのリストを読み書きするのは難しいでしょう。なぜならこれらの部分は反復的で意味がないからです。ただ``qtcharts`` の部分だけが役に立つからです。

source: The host operating system (windows, mac, or linux)
ja: ホストオペレーティングシステム(Windows、Mac、Linux)

source: The installation command we need is:
ja: 必要なインストールコマンドは以下のとおりです。

source: The name of a tool.
ja: ツールの名前です。

source: The name of the tool (this is `tools_mingw` in our case)
ja: ツールの名前(この例では`tools_mingw`です)

source: The next thing we need to do is find out what architectures are available for Qt 6.2.0 for Windows Desktop.
ja: 次にすべきことは、Qt 6.2.0 for Windows Desktopで利用可能なアーキテクチャを見つけることです。

source: The operating system on which the Qt development tools will run.
ja: Qt開発ツールが実行されるオペレーティングシステム。

source: The output of all of the :ref:`aqt list-qt <list-qt command>` commands is intended to make it easier for you to write programs that consume the output of :ref:`aqt list-qt <list-qt command>`.
ja: すべての :ref:`aqt list-qt <list-qt command>` コマンドの出力は、 :ref:`aqt list-qt <list-qt command>` の出力を消費するプログラムを作成しやすくするためのものです。

source: The output of this command is meant to be used with the :ref:`aqt install-tool <Tools installation command>` below.
ja: このコマンドの出力は、以下の :ref:`aqt install-tool <Tools installation command>` で使うことを意図しています。

source: The previous versions of these sub commands have been retained for backwards compatibility, but are no longer recommended.
ja: これらのサブコマンドの以前のバージョンは、下位互換性のために保持されていますが、お勧めできません。

source: The project configured to use Azure Pipelines, Github actions and Coveralls for regression test.
ja: プロジェクトは、Azure Pipelines、Githubアクション、Coverallsを使用してリグレッションテストを行うように設定されています。

source: The purpose of this command is to show you what arguments you can pass to the :ref:`archives flag <install archives flag>` when using the ``install-*`` commands.
ja: このコマンドの目的は、 ``install-*`` コマンドを使うときに :ref:`archives flag <install archives flag>` に渡すことができる引数を表示することです。

source: The subcommands ``install``, ``tool``, ``src``, ``doc``, and ``examples`` have been deprecated in favor of the newer ``install-*`` commands, but they remain in aqt in case you still need to use them.
ja: サブコマンドの「install」、「tool」、「src」、「doc」、および「examples」は、新しい「install-*」コマンドのために廃止されましたが、まだ使用する必要がある場合に備えて、aqtに残っています。

source: The target SDK (desktop, android, ios, or winrt)
ja: ターゲットSDK(デスクトップ、android、ios、winrt)

source: The target architecture
ja: ターゲット・アーキテクチャ

source: The type of device for which you are developing Qt programs.
ja: Qtプログラムを開発するデバイスのタイプ。

source: The version of Qt you would like to install
ja: インストールしたいQtのバージョン

source: There are four architectures available, and the error message from :ref:`aqt list-qt <list-qt command>` just told us what they are: `x86_64`, `x86`, `armv7`, and `arm64_v8a`.
ja: 利用可能なアーキテクチャは4つありますが、:ref:`aqt list-qt <list-qt command>` のエラーメッセージが、その4つを教えてくれます: `x86_64`、`x86`、`armv7`、`arm64_v8a`です。

source: There are only a few versions of Qt that support WASM, and they are only available for desktop targets.
ja: WASMをサポートするQtのバージョンはわずかしかなく、デスクトップターゲットでのみ利用できます。

source: There are some known mirror sites in default.
ja: 既定のミラーサイトには既知のものがあります。

source: There are various combinations to accept according to Qt version.
ja: Qtのバージョンに応じて、さまざまな組み合わせを受け入れることができます。

source: These checksums are used to verify that every other file that ``aqtinstall`` downloads is, in fact, the correct file, and not a corrupt or malicious copy of the file.
ja: これらのチェックサムは、``aqtinstall`` がダウンロードする他のすべてのファイルが、実際には正しいファイルであり、そのファイルの不正コピーや悪意のあるコピーではないことを確認するために使用されます。

source: These commands are used to install Qt, tools, source, docs, and examples.
ja: これらのコマンドは、Qt、ツール、ソース、ドキュメント、サンプルをインストールするために使用されます。

source: These commands are used to list the packages available for installation with ``aqt``.
ja: このコマンドは、``aqt`でインストールできるパッケージを一覧表示するために使用します。

source: This allow you to add modules to existent Qt installation.
ja: これにより、既存のQtインストールにモジュールを追加できます。

source: This command receives four parameters:
ja: このコマンドは4つのパラメータを受け取ります:

source: This command will print all versions of Qt available for Windows Desktop:
ja: このコマンドはWindowsデスクトップで利用可能なQtのすべてのバージョンを出力します:

source: This command will successfully install 3 archives: 1 for ``qtbase``, and one each for the two modules. If we had tried to use this command with previous versions of aqt, we would not have installed the two modules because we did not specify them in the ``--archives`` list.
ja: このコマンドは3つのアーカイブを正しくインストールします。1つは``qtbase``用で、もう1つは2つのモジュール用です。このコマンドをaqtの以前のバージョンで使用しようとすると、2つのモジュールは``--archives``リストに指定されていなかったので、インストールされませんでした。

source: This documentation refers to it as **the base Qt installation** instead of a **module** for several reasons:
ja: このドキュメントでは、さまざまな事情から**module**ではなく、 **the base Qt installation** とよんでいます。

source: This flag allows you to avoid installing parts of Qt that you do not need.
ja: このフラグを使うと、Qtの不要な部分をインストールするのを避けることができます。

source: This flag causes ``list-doc`` to print a list of modules available for installation using the `install-doc command`_, with the ``--modules`` option.
ja: このフラグは、``list-doc``に `install-doc command`_ と ``--modules`` オプションを使ってインストール可能なモジュールのリストを出力させます。

source: This flag causes ``list-example`` to print a list of modules available for installation using the `install-example command`_, with the ``--modules`` option.
ja: このフラグは、 ``list-example`` に `install-example command`_ と ``--modules`` オプションを使ってインストール可能なモジュールのリストを出力させます。

source: This flag lists all the modules available for Qt 5.X.Y with a host/target/extension/architecture combination, or the latest version of Qt if ``latest`` is specified.
ja: このフラグは、Qt 5.X.Yで利用可能なすべてのモジュールをホスト/ターゲット/拡張/アーキテクチャの組み合わせで一覧表示します。``latest`` が指定されている場合はQtの最新バージョンを表示します。

source: This flag lists all the modules available for Qt 5.X.Y with a host/target/extension/architecture combination, or the latest version of Qt if ``latest`` is specified. You can list available architectures by using ``aqt list-qt`` with the ``--arch`` flag described below.
ja: このフラグは、Qt 5.X.Yで利用可能なすべてのモジュールをホスト/ターゲット/拡張/アーキテクチャの組み合わせで一覧表示します。``latest`` が指定されている場合はQtの最新バージョンを表示します。利用可能なアーキテクチャを一覧表示するには、以下で説明する ``--arch`` フラグを付けて ``aqt list-qt`` を使用します。

source: This flag receives the name of at least one module as an argument:
ja: このフラグは少なくとも1つのモジュールの名前を引数として受け取ります:

source: This flag requires a list of at least two arguments: 'Qt version' and 'architecture'.
ja: このフラグには、'Qt version'と'architecture'の2つ以上の引数のリストが必要です。

source: This is a Qt version such as 5.9.7, 5.12.1 etc.
ja: これは5.9.7、5.12.1などのQtバージョンです。

source: This is a `SimpleSpec`_ that specifies a range of versions.
ja: これはバージョンの範囲を指定する `SimpleSpec`_ です。

source: This is a lot of archives. Note that there's a name collision between the ``debug_info`` archives and the archives in every other module/Qt base install: this is because there's a ``debug_info`` archive that corresponds to almost every other archive available.
ja: ここにはたくさんのアーカイブがあります。``debug_info``アーカイブと他のすべてのモジュール/Qtベースインストールのアーカイブとの間に名前の衝突があることに注意してください。これは、利用可能な他のほとんどすべてのアーカイブに対応する``debug_info``アーカイブがあるからです。

source: This is advanced option and not recommended to use for general usage.
ja: これは高度なオプションであり、一般的な使用にはお勧めできません。

source: This is advanced option and you should use it with ``--modules`` option.
ja: これは拡張オプションなので、``--modules`` オプションと一緒に使うべきです。

source: This is contribution guide for aqtinstall project.
ja: aqtinstallプロジェクトへの貢献ガイドです。

source: This is either ``True`` or ``False``.
ja: これは、 ``True``か ``False`` を値にとります。
